saewoonam/ble_adv_covid/nrf52 dongle/scan/main.c
#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms). Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms). Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds). Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating an event (connect or start of notification) to the first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump. Can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */


BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
NRF_BLE_SCAN_DEF(m_scan);                                                           /**< Scanning module instance. */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
    //{0xFD6F, 0x16}
};
static ble_uuid_t const m_scan_uuid =
{
    .uuid = 0xFD6F,
    .type = BLE_UUID_TYPE_BLE
};
static ble_uuid_t const m_nus_uuid =
{
    .uuid = BLE_UUID_NUS_SERVICE,
    .type = NUS_SERVICE_UUID_TYPE
};


static char m_nus_data_array[BLE_NUS_MAX_DATA_LEN];
static bool ready_to_write = true;
static bool cdc_open = false;
static bool output_cdc = false;
// BLE DEFINES END

/**
 * @brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of an assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/** @brief Function for initializing the timer module. */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&m_blink_ble, APP_TIMER_MODE_REPEATED, blink_handler);
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&m_blink_cdc, APP_TIMER_MODE_REPEATED, blink_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function to start scanning.
 */
static void scan_start(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(err_code);

}

void cdc_printf(char *format, ...) {

    va_list arg;
    va_start(arg, format);
    int len;
    static char buffer[64];

    if (cdc_open) {
        /*
        while (!ready_to_write) {
            NRF_LOG_INFO("waiting to write %d", ready_to_write);
            // nrf_delay_ms(10);
        }
        */
        len = vsnprintf(buffer, 64,format, arg);

        memcpy(m_nus_data_array, buffer, len);
        ready_to_write = false;
        ret_code_t ret;
        ret = app_usbd_cdc_acm_write(&m_app_cdc_acm,
                                                m_nus_data_array,
                                                len);
        if(ret != NRF_SUCCESS) {
            NRF_LOG_INFO("ret: %x, unable to cdc_printf: %s", ret, m_nus_data_array);
        } 
    }
}
    

/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
    ret_code_t err_code;
    // uint8_t magic[9] = {0x00, 0xFE, 0xED, 0xBE, 0xEF, 0xDE, 0xAD, 0xD0, 0xD0};
    uint8_t magic[4] = {0xFE, 0xED, 0xBE, 0xEF};
    /*
    uint8_t uuid[4] = {0x03, 0x03, 0x6F, 0xFD};
    //NRF_LOG_INFO("evt_id %d, rssi %d, ch %d", p_scan_evt->scan_evt_id, rssi, ch);
    //NRF_LOG_HEXDUMP_INFO(p_scan_evt->params.p_not_found->data.p_data, 7);
                     //p_scan_evt->params.p_not_found->data.len);
    //NRF_LOG_HEXDUMP_INFO(uuid, 4);
    int no_match = memcmp(uuid, p_scan_evt->params.p_not_found->data.p_data+3, 4);
    // NRF_LOG_INFO("no match: %d", no_match);
    if (no_match==0) {
      int8_t rssi = p_scan_evt->params.p_not_found->rssi;
      int8_t ch = p_scan_evt->params.p_not_found->ch_index;
      char mac_string[20];
      const uint8_t *addr = p_scan_evt->params.p_not_found->peer_addr.addr;
      int len=0;
      memcpy(mac_string, 0, 20);
      // NRF_LOG_HEXDUMP_INFO(p_scan_evt->params.p_not_found->peer_addr.addr, 6);
      for (int i=0; i<5; i++) {
          len += sprintf(mac_string+len, "%0X:", addr[5-i]);
      }
      len += sprintf(mac_string+len, "%0X", addr[0]);
      if (output_cdc) {
          cdc_printf("%d, %d, %s\r\n", rssi, ch, mac_string);
      }
    }
    */
    switch(p_scan_evt->scan_evt_id)
    {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
            err_code = p_scan_evt->params.connecting_err.err_code;
            APP_ERROR_CHECK(err_code);
            break;
        case NRF_BLE_SCAN_EVT_FILTER_MATCH:
            // NRF_LOG_INFO("scan filter match");
            if (output_cdc) {
                int8_t rssi = p_scan_evt->params.p_not_found->rssi;
                int8_t ch = p_scan_evt->params.p_not_found->ch_index;
                char mac_string[20];
                const uint8_t *addr = p_scan_evt->params.p_not_found->peer_addr.addr;
                int len=0;
                memcpy(mac_string, 0, 20);
                // NRF_LOG_HEXDUMP_INFO(p_scan_evt->params.p_not_found->peer_addr.addr, 6);
                for (int i=0; i<5; i++) {
                    len += sprintf(mac_string+len, "%0X:", addr[5-i]);
                }
                len += sprintf(mac_string+len, "%0X", addr[0]);
                // cdc_printf("%d, %d, %s\r\n", rssi, ch, mac_string);
                uint8_t raw[48];
                memset(raw, 0, 48);
                raw[0]=rssi;
                raw[1]=ch;
                
                memcpy(raw+2, addr, 6);
                memcpy(raw+8, p_scan_evt->params.p_not_found->data.p_data + 11, 20);
                       // p_scan_evt->params.p_not_found->data.len);  // len=31
                memcpy(raw+28, magic, 4);
                memcpy(m_nus_data_array, raw, 32);
                ret_code_t ret;
                ret = app_usbd_cdc_acm_write(&m_app_cdc_acm, m_nus_data_array, 32);
                if(ret != NRF_SUCCESS) {
                    NRF_LOG_INFO("ret: %x, unable to write raw: %s", ret, m_nus_data_array);
                }
                
                NRF_LOG_HEXDUMP_INFO(m_nus_data_array, 32);
            }
            break;
        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
        {
            NRF_LOG_INFO("Scan timed out.");
            scan_start();
        } break;


        default:
          break;
    }
}



static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;
    static ble_gap_scan_params_t const m_scan_param =
    {
        .active        = 0x0,  // no scan request
        .interval      = NRF_BLE_SCAN_SCAN_INTERVAL,
        .window        = NRF_BLE_SCAN_SCAN_INTERVAL,
        //.window        = NRF_BLE_SCAN_SCAN_WINDOW,
        .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
        .timeout       = 0,  // no timeout
        .scan_phys     = BLE_GAP_PHY_1MBPS,
        .extended      = false,
    };

