saewoonam/ble_adv_covid/nrf52 dongle/scan/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/** @brief Function for initializing buttons and LEDs. */
static void buttons_leds_init(void)
{
    uint32_t err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the nrf_log module. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/** @brief Function for placing the application in low power state while waiting for events. */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**
 * @brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    power_manage();
}


// USB CODE START
static bool m_usb_connected = false;


/** @brief User event handler @ref app_usbd_cdc_acm_user_ev_handler_t */
static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_cdc_acm_user_event_t event)
{
    app_usbd_cdc_acm_t const * p_cdc_acm = app_usbd_cdc_acm_class_get(p_inst);

    switch (event)
    {
        case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN:
        {
            /*Set up the first transfer*/
            ret_code_t ret = app_usbd_cdc_acm_read(&m_app_cdc_acm,
                                                   m_cdc_data_array,
                                                   1);
            NRF_LOG_INFO("open ret: %0X", ret);
            NRF_LOG_INFO("char: %d", m_cdc_data_array[0]);
            UNUSED_VARIABLE(ret);
            ret = app_timer_stop(m_blink_cdc);
            APP_ERROR_CHECK(ret);
            bsp_board_led_on(LED_CDC_ACM_CONN);
            NRF_LOG_RAW_INFO("CDC ACM port opened");
            cdc_open = true;
            break;
        }

        case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
            cdc_open = false;
            NRF_LOG_INFO("CDC ACM port closed");
            if (m_usb_connected)
            {
                ret_code_t ret = app_timer_start(m_blink_cdc,
                                                 APP_TIMER_TICKS(LED_BLINK_INTERVAL),
                                                 (void *) LED_CDC_ACM_CONN);
                APP_ERROR_CHECK(ret);
            }
            break;

        case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
            ready_to_write=true;
            //NRF_LOG_INFO("tx done");
            break;

        case APP_USBD_CDC_ACM_USER_EVT_RX_DONE:
        {
            int index = 0;
            int bytes_stored = 0;
            ret_code_t ret;
            char c;
            char buffer[64];
            memcpy(buffer, 0, 64);

            bytes_stored =  app_usbd_cdc_acm_bytes_stored(p_cdc_acm);
            // NRF_LOG_INFO("Bytes waiting: %d", bytes_stored);
            /*
            ret = app_usbd_cdc_acm_read(&m_app_cdc_acm,
                                        buffer,
                                        bytes_stored);
                          
            NRF_LOG_INFO("ret: %x", ret);
            NRF_LOG_HEXDUMP_INFO(buffer, bytes_stored);
            */
            
            size_t size;
            index = 0;
            do {
                size = app_usbd_cdc_acm_rx_size(p_cdc_acm);
                // NRF_LOG_INFO("RX: size: %lu", size);
                ret = app_usbd_cdc_acm_read(&m_app_cdc_acm,
                                            &c,
                                            1);
                if (ret==NRF_SUCCESS) {
                    // NRF_LOG_INFO("char: %x %d %c", ret, c, c);
                    buffer[index++] = c;
                }
                c=0;
            } while(ret==NRF_SUCCESS);
            c = buffer[bytes_stored-2];
            // NRF_LOG_INFO("c: %c", c);
            switch (c)
            {
                case 'r':
                    output_cdc = true;
                    break;
                case 'z':
                    output_cdc = false;
                    break;
                default:
                    break;
            }

            // NRF_LOG_HEXDUMP_INFO(buffer, bytes_stored);
            // ret = app_usbd_cdc_acm_write(&m_app_cdc_acm, buffer, bytes_stored);
            // NRF_LOG_INFO("retcode after write: %x", ret);
            
            break;
        }
        /*
        {
            ret_code_t ret;
            static uint8_t index = 0;
            index++;

            do
            {
                if ((m_cdc_data_array[index - 1] == '\n') ||
                    (m_cdc_data_array[index - 1] == '\r') ||
                    (index >= (m_ble_nus_max_data_len)))
                {
                    if (index > 1)
                    {
                        bsp_board_led_invert(LED_CDC_ACM_RX);
                        NRF_LOG_INFO("Ready to send data over BLE NUS");
                        NRF_LOG_HEXDUMP_DEBUG(m_cdc_data_array, index);

                        do
                        {
                            uint16_t length = (uint16_t)index;
                            if (length + sizeof(ENDLINE_STRING) < BLE_NUS_MAX_DATA_LEN)
                            {
                                memcpy(m_cdc_data_array + length, ENDLINE_STRING, sizeof(ENDLINE_STRING));
                                length += sizeof(ENDLINE_STRING);
                            }

                            ret = ble_nus_data_send(&m_nus,
                                                    (uint8_t *) m_cdc_data_array,
                                                    &length,
                                                    m_conn_handle);

